tap "nikitabobko/tap" # Aerospace
tap "vvvvv/zig"        # for Zig nightly builds

# CLI Tools
brew "git"
brew "fzf"
brew "ripgrep"
brew "bat"
brew "htop"
brew "lazygit"
brew "lazysql"
brew "awscli"
brew "jq"
brew "yq"
brew "gh"
brew "delta"
brew "tmux"
brew "stow"
brew "neovim"
brew "kubectl"       # Kubernetes CLI
brew "tailscale"     # Secure mesh VPN for homelab and remote access
brew "podman"

# Languages n stuff
brew "uv"
# brew "node"
# brew "nvm"
brew "fnm"          # fast node manager in rust
brew "openjdk"
brew "clojure"
brew "go"

# GNU Utilities
brew "coreutils"
brew "gnu-sed"
brew "findutils"
brew "gawk"

# GUI Applications
cask "iterm2"
cask "visual-studio-code"
cask "raycast"
# cask "docker"
cask "podman-desktop"
cask "ghostty"
cask "aerospace"
cask "caffeine"
cask "chatgpt"
cask "claude"
cask "shottr"
cask "caffeine"
cask "mattermost"
cask "brave-browser" 
# cash "zoom" - I don't want to install this by default

# Fonts
cask "font-jetbrains-mono-nerd-font"

# Zig programming
cask "zig@nightly"

